#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan on staging env 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/so-gineers/workbook/runs/run-e4xw6NZ6xGbjMMUk

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_app.workbook will be created
  + resource "heroku_app" "workbook" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "workbook_staging"
      + region                = "us"
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.workbook will be created
  + resource "heroku_build" "workbook" {
      + app               = "workbook_staging"
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + url      = "https://github.com/so-gineers/workbook/releases/0.0.1"
          + version  = "0.0.1"
        }
    }

  # heroku_domain.workbook will be created
  + resource "heroku_domain" "workbook" {
      + app             = "workbook_staging"
      + cname           = (known after apply)
      + hostname        = "api-staging-workbook.so-gineers.com"
      + id              = (known after apply)
      + sni_endpoint_id = (known after apply)
    }

  # heroku_formation.workbook will be created
  + resource "heroku_formation" "workbook" {
      + app      = "workbook_staging"
      + id       = (known after apply)
      + quantity = 1
      + size     = "Standard-1X"
      + type     = "web"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + heroku_web_hostname = (known after apply)
  + heroku_web_url      = (known after apply)

```

</details>

*Author: @papapathe, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform-heroku.yml`*